Catalogs/рд_СценарийРассылкиДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>рд_СценарийРассылкиДокументов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОбъектПечати</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МакетПечати</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетнаяЗаписьПочты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитАдресации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресОтвета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТемаСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Формат</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФорматыСохраненияОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПолучателиКопийОтправлений</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Получатель</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/рд_СценарийРассылкиДокументов/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область КлиентскаяЧасть


&НаКлиенте
Процедура МакетПечатиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	 СтандартнаяОбработка = ложь;
	 
	 списокМакетов = получитьСписокМакетов();
	 Оповещение = Новый ОписаниеОповещения("ПослеВыбораМакета", ЭтотОбъект);
	 списокМакетов.ПоказатьВыборЭлемента(Оповещение, "Выберите тип макета.");

КонецПроцедуры
 
 
&НаКлиенте
Процедура ПослеВыбораМакета(ВыбранныйЭлемент, СписокПараметров) Экспорт
    Если ВыбранныйЭлемент = Неопределено Тогда
        Сообщить("Макет не выбран!");
		возврат;
    Иначе
        Объект.МакетПечати = ВыбранныйЭлемент.Значение;
	КонецЕсли;
	
	
КонецПроцедуры 

&НаКлиенте
Процедура РеквизитАдресацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = ложь;

	списокРеквизитовАдресации = получитьСписокРеквизитовАдресации(); 

	Оповещение = Новый ОписаниеОповещения("ПослеВыбораРеквизитаАдресации", ЭтотОбъект);
	 списокРеквизитовАдресации.ПоказатьВыборЭлемента(Оповещение, "Выберите реквизит адресации.");

КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораРеквизитаАдресации(ВыбранныйЭлемент, СписокПараметров) Экспорт
    Если ВыбранныйЭлемент = Неопределено Тогда
        Сообщить("Реквизит не выбран!");
		возврат;
    Иначе
        Объект.РеквизитАдресации = ВыбранныйЭлемент.Значение;
	КонецЕсли;
	
	
КонецПроцедуры 



#КонецОбласти



#Область СервернаяЧасть

Функция получитьСписокМакетов()

	списокМакетов = Новый СписокЗначений();
	
	ОбъектМетаданных = общегоНазначения.ОбъектМетаданныхПоИдентификатору(объект.ОбъектПечати, ложь);
	КомандыПечати = УправлениеПечатью. КомандыПечатиОбъекта(ОбъектМетаданных);

	Для каждого стр Из КомандыПечати Цикл
	
		списокМакетов.Добавить( стр.Идентификатор, стр.Представление );
	
	КонецЦикла; 

	возврат списокМакетов;
	
КонецФункции // получитьСписокМакетов()

Функция получитьСписокРеквизитовАдресации()

	списокРеквизитов = Новый СписокЗначений();

	ОбъектМетаданных = общегоНазначения.ОбъектМетаданныхПоИдентификатору(объект.ОбъектПечати, ложь);

	массивТиповС_КИ = получитьМассивТиповС_КИ();
	
	Для каждого рекв Из ОбъектМетаданных.реквизиты Цикл
		
		Для каждого типКИ Из массивТиповС_КИ Цикл
		
			Если рекв.тип.СодержитТип( типКИ ) Тогда
			
				 списокРеквизитов.Добавить(рекв.имя, рекв.имя);
			
			КонецЕсли;
		
		КонецЦикла;
		
				 	
	КонецЦикла;		

	возврат списокРеквизитов;
	
КонецФункции // ()


Функция получитьМассивТиповС_КИ()

	массивТиповС_КИ = новый Массив;
	
	Для каждого спр Из метаданные.справочники Цикл
	
		    Если спр.ТабличныеЧасти.найти("КонтактнаяИнформация") <> неопределено Тогда
			
				 массивТиповС_КИ.Добавить( тип("справочникСсылка." + спр.имя) );
			
			КонецЕсли; 
	
	КонецЦикла;
	    
	возврат массивТиповС_КИ;

КонецФункции // ()

&НаКлиенте
Процедура ОбъектПечатиПриИзменении(Элемент)
	
	объект.МакетПечати = неопределено;
	объект.РеквизитАдресации = неопределено;
	
	
КонецПроцедуры


#КонецОбласти
